package com.fincue.ccloanAutomation.testdata;

public class TestDataForGeneralInfo {
    //How to pay off  (paragrafs)
    //paragraf1
    public static final String paragraf1 = "На сайте компании Вы можете погасить кредит при помощи банковской карты " +
            "Visa и Master Card в любое удобное для Вас время, в течение 24 часов/7 дней в неделю." +
            " Это удобный и быстрый способ, который не отнимет у Вас много времени.";

    //paragraf2
    public static final String paragraf2 = "Вы можете воспользоваться терминалами самообслуживания iBox." +
            " Для успешного погашения кредита Вам необходимо указать ваш ИНН и сумму погашения, после чего внести средства к оплате. ";

    //paragraf3
    public static final String paragraf3 = "Воспользоваться услугой перевода средств Вы можете в кассе любого банковского отделения " +
            "Украины или через систему Интернет-банкинга вашего банка." +
            " Для этого Вам потребуется внести нужную сумму для погашения кредита в кассе или на " +
            "Ваш счет для погашения через Интернет-банкинг и осуществить перевод, указав реквизиты ООО «Е-КЕШ»." +
            " В назначении платежа не забудьте указать ФИО, номер вашего кредитного договора и ИНН.";

    //How to take (paragrafs)
    //paragraf1
    public static final String howToTakeParagraf1 = "Для того, чтобы получить онлайн кредит от E-cash, " +
            "Вам необходимо пройти регистрацию на сайте компании, внести Ваши личные данные в анкетную форму, после чего ознакомиться с " +
            "Правилами кредитования и принять условия Договора, а также дать согласие на обработку Ваших личных данных.";

    //paragraf2
    public static final String howToTakeParagraf2 = "На главной странице нашего сайта Вы можете воспользоваться кредитным калькулятором, " +
            "с помощью которого выберите желаемую сумму и срок кредитования, после чего нажмите кнопку" +
            " «Получить кредит» и перейдите в окно «Оформление заявки». Если Вы уже пользовались сервисом онлайн кредитования " +
            "от E-cash - оформить последующие обращения можно в личном кабинете.";

    //paragraf3
    public static final String howToTakeParagraf3 = "При первом обращение в сервис онлайн кредитования E-cash " +
            "Вам необходимо заполнить заявку на кредит и добавить данные банковской карты, на которую желаете получить кредит." +
            " После этого наша система обработает полученные данные и отправит решение по заявке в личный кабинет.";

    //paragraf4
    public static final String howToTakeParagraf4 = "Для подтверждения банковского счета Вам следует пройти верификацию банковской карты, " +
            "чтобы убедиться, что именно Вы владеете указанной банковской картой. Для этого на Вашем счету будет заблокирована сумма " +
            "до 1 гривны и после успешного прохождения верификации карты эта сумма будет разблокирована. " +
            "Весь процесс происходит автоматически и занимает несколько минут.";

    //paragraf5
    public static final String howToTakeParagraf5 = "После обработки Вашей заявки на кредит и успешной верификации карты на " +
            "Ваш номер телефона и электронный адрес будет отправлено уведомление о решении по кредиту. После того, как" +
            " Вы подпишите кредитный договор в личном кабинете, деньги автоматически будут переведены на вашу карту.";


    //Contacts info
    //PhoneNumber1
    public static final String contactsNumber1 = "+38(044) 337 88 33";

    //PhoneNumber2
    public static final String contactsNumber2 = "+38(068) 611 41 31";

    //PhoneNumber3
    public static final String contactsNumber3 = "+38(099) 611 41 31";

    //PhoneNumber4
    public static final String contactsNumber4 = "+38(063) 611 41 31";

    //Email
    public static final String contactsEmail = "info@e-cash.com.ua";

    //WorkHours
    public static final String contactsWorkHours= "Пн.-Пт. с 08:00 до 20:00";

    //WorkHoursWeekend
    public static final String contactsWorkHoursWeekend= "09:00 до 18:00";

    //Address
    public static final String contactsAddress= "Украина, 01021, г. Киев, ул. КЛОВСКИЙ СПУСК, 7А";



}
